const answer = '첫번째로 Node.js는 비동기 I/O 모델을 사용하므로 I/O 작업이 많은 서버 애플리케이션에서 매우 높은 처리량과 성능을 제공한다 +\
이를 통해 Node.js는 다른 서버 사이드 플랫폼과 비교하여 빠른 응답 시간과 확장성을 제공할 수 있다는 장점이 있다 +\
두번째로 단일 스레드와 이벤트 기반이다.+\
Node.js는 이벤트 기반 및 단일 스레드 모델을 사용하므로 여러 스레드가 필요하지 않아 개발과 유지 보수가 간단하다.+\
세번째는 높은 생산성이다. Node.js는 JavaScript 언어를 사용하므로 다른 서버 사이드 플랫폼과 비교하여 +\
프로그래밍 언어를 학습하는 데 필요한 시간이 상대적으로 짧다. +\
또  Node.js는 쉽게 모듈화하고 패키징할 수 있는 툴을 제공하므로 생산성이 매우 높은 장점이 있다.+\
이러한 장점들로  Node.js는 높은 성능, 생산성, 효율성, 확장성 및 유지 보수 용이성을 제공하는 좋은 서버 사이드 플랫폼이다.';
console.log(answer);
